##### quiz
```
local city_info 데이터베이스의 popular 테이블의 데이터를 가져와
ubuntu test 데이터베이스의 popular 테이블로 마이그레이션하는 코드를 작성
```

In [7]:
# read local city_info popular 

import MySQLdb, pickle
import pandas as pd
from sqlalchemy import create_engine

In [3]:
# write ubuntu test popular
db = MySQLdb.connect(
    "127.0.0.1",
    "root",
    pw,
    "city-info",
    charset='utf8',
)

In [4]:
SQL_QUERY = """
    SELECT *
    FROM popular;
"""

In [5]:
city_df = pd.read_sql(SQL_QUERY, db)
city_df

   rank city_name  popular
0     1     seoul  9904312
1     2     busan  3448737
2     3   incheon  2890451
3     4     daegu  2466052
4     5   daejeon  1538394
5     6  gwanggju  1502881
6     6  gwanggju  1502881

In [6]:
engine = create_engine("mysql+mysqldb://root:" + pw + "@anylee2142.ml/world")

city_df.to_sql(name="popular", con=engine, if_exists='replace')

d:\anaconda\lib\site-packages\sqlalchemy\dialects\mysql\base.py:1569: Warning: (1287, "'@@tx_isolation' is deprecated and will be removed in a future release. Please use '@@transaction_isolation' instead")
  cursor.execute('SELECT @@tx_isolation')